#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd
ls1 = [4, 8, 15, 16, 23, 42,4,5,6,7]
ser1 = pd.Series(ls1)
ser1

0     4
1     8
2    15
3    16
4    23
5    42
6     4
7     5
8     6
9     7
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:

#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.
ls2 = [1,2,3,4,5,6,'a','b','c','d']
ser2 = pd.Series(ls2)
print(ser2)

df2 = pd.DataFrame({'ser1':ls1, 'ser2': ls2})
df2

df3 = pd.DataFrame(ls1,ls2)
df3

0    1
1    2
2    3
3    4
4    5
5    6
6    a
7    b
8    c
9    d
dtype: object

    0
1   4
2   8
3  15
4  16
5  23
6  42
a   4
b   5
c   6
d   7

#### Q3. Create a Pandas DataFrame that contains the following data:
    Name, Age, Gender
    Alice, 25, Female
    Bob, 30, Male
    Claire, 27, Female

In [5]:
dic1 = {'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female', 'Male', 'Female']
                }
df = pd.DataFrame(dic1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
    Ans. In pandas, a DataFrame is a two-dimensional labeled data structure that is capable of holding data of different types. It is similar to a table in a relational database or a spreadsheet in Excel. A DataFrame consists of rows and columns, where each column can have a different data type (e.g., integer, float, string).

    On the other hand, a Series is a one-dimensional labeled array that can hold data of any type. It is similar to a single column in a DataFrame or a one-dimensional array in NumPy.

In [7]:
data = {
    'Product': ['A', 'B', 'C', 'D'],
    'Quantity': [10, 5, 8, 12],
    'Price': [25.5, 12.9, 18.7, 10.2]
}

df = pd.DataFrame(data)

ser = df['Product']
print(df) # example of dataframe
print(ser) # example of series

  Product  Quantity  Price
0       A        10   25.5
1       B         5   12.9
2       C         8   18.7
3       D        12   10.2
0    A
1    B
2    C
3    D
Name: Product, dtype: object

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
    Ans. head() and tail(): These functions are used to view the first few rows (head()) or the last few rows (tail()) of a DataFrame. They are helpful for inspecting the structure and content of the DataFrame.

    info(): It provides a summary of the DataFrame, including the data types, number of non-null values, and memory usage. It helps in understanding the overall structure of the DataFrame.

    describe(): This function generates descriptive statistics of the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartiles, for numeric columns. It provides a quick overview of the distribution of the data.

    shape: It returns the dimensions of the DataFrame as a tuple, representing the number of rows and columns.

    columns: It returns the column labels of the DataFrame.

    index: It returns the row labels of the DataFrame.

    loc[] and iloc[]: These functions are used for indexing and selecting data from a DataFrame. loc[] is label-based, meaning it uses row and column labels, while iloc[] is integer-based, using integer positions. You can use these functions to access specific rows or columns based on your criteria.

    drop(): This function is used to drop specified rows or columns from the DataFrame. It allows you to remove unnecessary or redundant data.

    sort_values(): It sorts the DataFrame based on specified columns. You can sort the data in ascending or descending order. Sorting is useful for organizing data and finding patterns.

    groupby(): This function is used for grouping data based on one or more columns. It enables you to perform aggregate operations on the grouped data, such as calculating sums, means, or counts.

    fillna(): It is used to fill missing values in the DataFrame with specified values or methods, such as forward-fill or backward-fill.

    apply(): This function applies a given function to each element or column of the DataFrame. It is useful for performing custom operations or transformations on the data.

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
    Ans. Series and DataFrame are mutable while Panel is not.

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [9]:
import pandas as pd

names = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
ages = pd.Series([25, 30, 35, 40])
cities = pd.Series(['New York', 'London', 'Paris', 'Tokyo'])

# Create a DataFrame using the above 3 Series
data = {'Name': names, 'Age': ages, 'City': cities}
df = pd.DataFrame(data)
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo